app/views/topics/edit.html.erb

    <%= f.label :category_id, "Категория" %><br />
    <%= f.collection_select :category_id, Category.all, :id, :title, include_blank: true %>
---
SELECT "categories".* FROM "categories"

    <%= f.label :location_id, "Локация" %><br />
    <%= f.collection_select :location_id, Location.all, :id, :name, include_blank: true %>
---
SELECT "locations".* FROM "locations"