app/views/topics/new.html.erb

SELECT "categories".* FROM "categories"
---
      <%= form.label :category_id, "Категория", class: "form-label" %>
      <%= form.collection_select :category_id, Category.all, :id, :title,
          { include_blank: true },
          { class: "form-select" } %>

SELECT "locations".* FROM "locations"
---
      <%= form.label :location_id, "Локация", class: "form-label" %>
      <%= form.collection_select :location_id, Location.all, :id, :name,
          { include_blank: true },
          { class: "form-select" } %>