app/views/topics/show.html.erb

<h3>Комментарии</h3>
<% @topic.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."topic_id" = $1  [["topic_id", 3]]