app/views/topics/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."topic_id" = $1  [["topic_id", 36]]
---
    <div class="comments-list mb-4">
      <% @topic.comments.each do |comment| %>