app/controllers/comments_controller.rb

SELECT "topics".* FROM "topics" WHERE "topics"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "comments" ("topic_id", "user_id", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["topic_id", 3], ["user_id", 3], ["content", "HHHHHH"], ["created_at", "2024-10-29 13:33:49.332754"], ["updated_at", "2024-10-29 13:33:49.332754"]]
---
  def create
    @topic = Topic.find(params[:topic_id])
    @comment = @topic.comments.build(comment_params)
    @comment.user = current_user

    if @comment.save