app/controllers/subscriptions_controller.rb

INSERT INTO "subscriptions" ("email", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["email", "[FILTERED]"], ["created_at", "2024-10-30 02:19:52.583617"], ["updated_at", "2024-10-30 02:19:52.583617"]]
---
     def create
       @subscription = Subscription.new(subscription_params)

       if @subscription.save