app/controllers/topics_controller.rb

     def index
          @topics = Topic.order(created_at: :desc)
---
SELECT "topics".* FROM "topics" ORDER BY "topics"."created_at" DESC

     def create
          @topic = current_user.topics.build(topic_params)
          if @topic.save
---
INSERT INTO "topics" ("title", "description", "creator_user_id", "location_id", "category_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

     def update
       if @topic.update(topic_params)
---
UPDATE "topics" SET "location_id" = $1, "updated_at" = $2 WHERE "topics"."id" = $3  [["location_id", 11], ["updated_at", "2024-10-30 02:43:53.018968"], ["id", 36]]

     def destroy
          @topic = Topic.find(params[:id])
          authorize! :destroy, @topic
          @topic.destroy
---
SELECT "topics".* FROM "topics" WHERE "topics"."id" = $1 LIMIT $2  [["id", 22], ["LIMIT", 1]]
DELETE FROM "topics" WHERE "topics"."id" = $1  [["id", 22]]